<template>
  <div class="privacy">
    <div class="content">
      <pre>
本隐私政策旨在向用户（以下或称“您”）清晰地说明您的个人信息将（基于您的选择）被如何收集、存储、保护、使用及对外披露等。如果您不同意本隐私政策, 请不要访问或使用本服务。因此，我方建议您完整地阅读本隐私政策，以帮助您了解维护自己隐私权的方式。
<code><span>一、适用范围及原则</span></code>
1.本政策适用于我方提供的所有服务，包括向您提供网站、移动端应用及相关技术服务。
2.本政策不适用于其他第三方向您提供的服务，以及特此明确，在不违反相关法律法规及本政策的情况下，若您利用我方提供的服务为您的用户再行提供服务，您应当另行与您的用户约定隐私权相关政策。
3.我方尊重并保护您的隐私权，并且将以高度勤勉和审慎的义务对待您的个人信息。在您使用我方提供的服务时，将仅为遵守国家法律法规及监管规定，以及为向您提供服务，进行收集、存储、保护、使用及对外披露您的个人信息，并将严格遵守相关法律法规及本政策政策执行。
<code><span>二、信息收集</span></code>
为更好地使您理解自己的相关权利义务，我方将您在使用Ego服务过程中可能涉及提供或被收集、存储、使用的个人信息如下：
1.您注册登记及提交的个人信息。例如，您的姓名、性别、出生日期、电子邮件地址、网站信息、电话号码、短消息校验码、地址和个人照片等资料；
2.实名认证信息。例如，您通过人脸识别技术进行实名认证，您需向我方提供面部特征的生物识别信息；
3.通讯录信息。例如，您在使用我方服务时建立的通讯账户、通讯名录及联系信息等。
4.处理您向我方或公众提供的社交媒体个人资料和其他社交媒体个人资料信息, 包括微信、支付宝、微博、QQ 等；
5.数字钱包信息, 例如信用卡、银行账户或其他支付细节等财务信息；
6.我方向您提供的任何服务的详细信息，如您在使用Ego服务过程中产生的用户咨询记录、报障记录和针对用户故障的排障过程等；
7. 其他相关信息。为了帮助您更好地使用我方服务，我方会收集相关信息。例如，我方获得您在使用第三方服务时所产生或分享的信息。
<code><span>三、信息的使用</span></code>
1.为您提供Ego服务或与之相关服务使用信息及使用服务过程中的各种身份验证。
2.为履行双方基于本隐私政策、《用户服务协议》所约定权利义务之必要。
3.为了验证您提供信息的准确性和完整性，我方进行的信息核对和校验，处理验证。
4.提醒您有关我方服务的调整与更新，或向您提供或推送电子信息。
5.确保我方为您提供合适的服务内容并依据您的反馈信息进行维护、改进。
6.在第三方获得您授权的前提下，该第三方可基于授权内容查看、获取您的相关个人信息数据，并由我方提供相应服务以促成该等授权之实现。
7.经您执行特定授权操作后，依据操作页面信息、单项协议（如有）内容明确约定的其他用途。
8.创建、开发、运营、交付和改进我方的服务，履行《用户服务协议》项下服务提供以及执行解决解决。
9.为提高您使用本服务的准确性及安全性，我方可能使用您的个人信息来判断您的账户风险、进行身份验证、安全事件的检测及防范。
10.遵守适用的法律法规和其他部门规章、条例、地方法规以及我方有义务遵守的主管政府当局的命令和指示, 并管理相关风险。
11.如果我方需要将您的任何个人信息用于本隐私政策未载明的其他用途时，我方会按照法律法规及相关约定的要求以确认电子协议、具体场景下的文案内容确认动作等形式再次向您告知并征得您的同意。
<code><span>四、信息的保护</span></code>
1.我方尊重您的个人隐私权，将通过内部管理制度严格控制内部接触人员范围，确保相关内部人员接触、使用您的上述个人信息范围仅为履行Ego用户服务协议之必要，并通过内部安全和隐私保护培训等形式，加强内部人员对于保护个人信息重要性的认识。
2.我方作为Ego服务方，将妥善维护系统及相关服务，采取各种措施以尽量降低您的个人信息被泄露、毁损、误用、非授权访问、非授权披露和更改的风险。
3.如您通过Ego提供的区块链技术服务进行个人信息数据的相关交易，整个交易过程将采用合理的保密交易机制，防止第三方截取该数据包。
4.您应了解并同意，尽管我方会尽最大努力保护您的数据安全，但由于技术手段的不断更新，我方无法杜绝全部的非安全因素，因此我方无法就此作出任何保证。任何非因我方过错造成的安全问题，在不违反相关法律法规的前提下，您同意我方就此免责。
5.如果我方的技术或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改或毁坏，致使不幸发生用户个人信息安全事件（泄露、丢失等），我方将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我方已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我方将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我方会采取合理、有效的方式发布公告。就用户个人信息安全事件产生的后果，我方将按照相关法律法规的规定承担相应责任。
<code><span>五、信息管理</span></code>
1.您可以在使用我方服务的过程中，访问、修改和删除您提供的注册信息和其他个人信息。您访问、修改和删除个人信息的范围和方式将取决于您使用的具体服务。
2.我方将按照本政策所述，收集、使用您的信息。如您发现我方违反法律、行政法规的规定或者双方的约定收集、使用您的个人信息，您可以要求我方删除。如您发现我方收集、存储的您的个人信息有错误的，您也可以要求我方更正。
3.在您访问、修改和删除相关信息时，我方可能会要求您进行身份验证（如有），以保障帐号的安全。
<code><span>六、信息披露</span></code>
1.我方会在如下情况披露您的个人信息：
（1）履行我方在《Ego用户服务协议》或本政策中的义务和行使我方的权利；
（2）获得您明确同意或基于您的主动选择；
（3）在我方发生合并、收购、资产转让等交易导致向第三方披露您的个人信息时，我方将通过推送通知、公告等形式告知您相关情形，按照法律法规及不低于本政策所要求的标准继续保护或要求新的管理者继续保护您的个人信息。
2.基于如下情况，公开披露您的个人信息无需事先征得您的授权同意：
（1）与国家安全、国防安全有关的；
（2）与公共安全、公共卫生、重大公共利益有关的；
（3）与犯罪侦查、起诉、审判和判决执行等有关的；
（4）出于维护您或其他个人的生命、财产等重大合法权益但又难以得到本人同意的；
（5）您自行向社会公众公开的个人信息；
（6）从合法公开披露的信息中收集的个人信息，如合法的新闻报道、政府信息公开等渠道。
<code><span>七、责任声明</span></code>
您在使用Ego服务过程中，可能包含第三方网站、应用和服务的链接或接口，如果您通过上述途径访问或使用第三方网站、应用和服务，您应知悉该第三方有自己的隐私政策并自行向该第三方获取、了解向该隐私政策，我方无法保证第三方会按照我方的要求采取保护措施，且我方对此不做任何承诺及保证，亦不对此承担任何责任。如您发现这些第三方网站、应用或服务存在风险时，建议您终止相关操作以保护您的合法权益。
<code><span>八、其他</span></code>
1.如出现我方网站、应用或服务停止运营的情形，我方会采取合理措施保护您个人信息安全，包括对您的个人信息进行删除或匿名化处理等，相关停止运营的通知将以网页公告、App推送通知、邮件、短信等方式通知到您。
2.我方有权依据国家法律法规及运营需求等随时对本政策进行修改，我方将以网页公告、App推送通知、邮件、短信等方式对该等变更予以公布、通知。变更后的政策自以上述方式公布、通知之日起生效。为了您能及时接收到通知，建议您在联系方式更新时及时通知我方。若您在本政策变更的政策生效后，仍继续使用本服务的，即表示您已认真阅读、充分理解并同意接受该等变更；若您不同意的，您有权拒绝接受本政策，您应立即停止使用本服务。

                                                                                                                                                                                                                                                                                                                                   武汉极意网络科技有限公司

    </pre>
    </div>
  </div>
</template>

<style lang="scss" scoped>
@import "../style/global.scss";

code {
    span {
        font-weight: 500;
        color: #fff;
    }
}

.privacy {
  background-color: #0d1424;
  display: flex;
  justify-content: center;
  align-items: center;
  flex-direction: column;
  .content {
    display: flex;
    justify-content: center;
    align-items: center;
    flex-direction: column;
    width: 90vw;
    padding: 20px 0;
    pre {
      @include p(14px, 26px);
      color: #b8c7e0 !important;
      white-space: pre-wrap;

      @media screen and (min-width: 1180px) {
        width: 1180px;
      }
    }

    p {
      width: 100%;
      text-align: right;
    }
  }
}
</style>
