<template>
  <div class="service">
    <div class="content">
     <pre>
欢迎使用 “Ego”服务（以下简称：本服务），在同意签署《用户服务协议》（以下简称：本协议），并承诺遵守协议项下之条款时，使用本服务。
本服务是Ego团队(以下或称“我方”)基于区块链技术为用户 (以下或称“您”)提供的创建私钥、加密储存、管理数字资产及授权、管理个人信息数据等服务。您确认，在您开始使用本服务前，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。本协议内容不会被您所属国家或地区的法律禁止。
为了保障您的权益，您在申请注册流程中同意并确认本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。免除或者限制责任的条款将以粗体下划线标识，您应重点阅读。如您对本协议有任何疑问，可向我方客户进行咨询。
本协议自您通过网络页面以点击“确认”等形式（具体以页面展示为准）接受并首次使用本服务时成立并生效，且视为您已充分理解并同意接受本协议及其项下条款。如果您不同意本协议或其中任何条款约定，您应立即停止注册行为，并将无法使用本服务。本协议构成您与我方达成的协议，具有法律效力，各方应遵守协议之条款。
<code><span>第一条 定义</span></code>
1.Ego服务：Ego是新一代去中心化的用户身份解决方案。Ego服务是指您在同意本协议，并遵守本协议之条款情况下，由我方为您提供的创建私钥、加密储存、管理数字资产及授权、管理个人信息数据等服务。
2.Ego ID：当您按照Ego APP提示填写信息、阅读并同意本协议且完成全部注册程序后，您通过注册程序所创建身份的唯一标识。
3.经验：您在Ego服务过程中进行各种操作（如身份信息认证、社交账号绑定、邀请好友、签到等）后产生的奖励。奖励将根据本协议服务规则、用户参与时间及操作行为等综合评定。
4.EGO：基于区块链技术产生的奖励，根据用户经验值的不同，您每天能获取不同数量的EGO。EGO的总量固定，随着时间获取难度增加，经验值越高能获取的EGO越多。因此，用户参与Ego生态越早获取EGO的优势越大。
5.毛豆：您授权第三方网站或者APP使用您的身份数据时，第三方支付给您的奖励。第三方请求您的不同身份数据时，会支付给您不同数量的毛豆。
<code><span>第二条 注册及用户资料</span></code>
1.您在使用本服务之前，必须先行注册，并填写注册资料，取得Ego账户、密码。本服务账户注册资料包括但不限于您的账户名称、密码、注册或更新本服务账户时输入的所有信息。
2. 您可同意本服务协议后，自行注册Ego ID信息，但您承诺遵守法律法规、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性，并遵守《互联网用户账号名称管理规定》及相关管理规定，且账号名称、头像等注册信息中不得含有违法和不良信息。
3.当您注册时，应当按Ego APP提示填写您真实的信息及其他必要的信息以完成注册。我方会帮助您生成对应的区块链账户地址及私钥，地址和私钥具有唯一性，私钥可以用于特定情形下的收付行为等用途。您应妥善保管您的区块链账户地址及相关私钥，您的账户信息、私钥均储存于区块链中，不会被获取、储存、备份于我方服务器中，区块链账户地址与相关私钥不得更改。如您不慎丢失账户地址或私钥，将无法通过Ego服务找回，您将自行承担相关损失。
4.您的Ego ID信息（含区块链账户地址或相关私钥）仅限您个人使用，请勿与他人共享或私自赠与、借用、租用、转让或售卖，以免产生不必要的纠纷。您应当妥善保管自己的Ego ID信息，确保自己的移动设备、账户密码、私钥和其他个人信息的安全，防止泄露，我方不负责该等信息的保管。如发生此类信息泄露的情况，我方无法也不能保护您的数据信息权益，您应自行承担由此产生的全部损失。
5.您了解，当您在Ego APP上创建或导入账户时，您的私钥和其他信息仅存储在当前移动设备上，而不是存储在Ego APP或我方。您可以根据Ego APP指南切换设备并导入您的账户。但是，如果您不保存或备份您的账户密码、私钥等, 并且您的移动设备丢失, 您的账户将丢失, 我方将无法检索它。您将对所遭受的损失负责。如果您在导出、保存或备份账户或私钥时丢失了密码，或者保存或备份上述信息的设备或服务器遭到黑客攻击，或者您失去了对该信息的控制，您的账户将丢失，我方将无法恢复，您将对所遭受的损失负责。
6.我方提供的Ego服务系基于您注册及操作所提供的信息完成创建私钥、加密储存、管理数字资产及授权、管理个人信息数据等服务。如果您提供任何不真实、不准确、不完整或不能反映当前情况的资料的，或我方有合理理由怀疑该等资料不真实、不准确、不完整或不能反映当前情况的，我方保留停止您使用本服务的权利。如因用您资料不真实、不准确、不完整或不能反映当前情况而给我方造成损失或提供服务发生错误，您应自行承担该等损失。若您以虚假信息骗取Ego ID信息等注册资料或存在违法和不良信息的，我方有权采取通知限期改正、暂停使用、注销登记等措施。
<code><span>第三条 服务提供</span></code>
1.您可以使用Ego创建自己的数字标识和全面的个人肖像，通过加密算法实现隐私保护，并完成数字标识与现实生活中身份应用程序方案之间的连接。
2.在Ego上建立用户身份账户系统，Ego的身份账户系统与w3c的did计划兼容，允许分布式和多样化的身份以及包括个人、组织等在内的各种实体的认证。
3.Ego使用各种身份验证方法，包括身份认证和社交媒体绑定 (包括但不限于微信、支付宝、微博、QQ 等)。
4.通过灵活配置和集成自己的授权服务或第三方的身份验证机制，您可以对身份信息进行授权管理。当您的身份被使用时，您将收到数据使用请求，请检查请求并回复确认。
<code><span>第四条  使用规范</span></code>
1.您保证在使用Ego创建ID及提交注册信息时，ID账号、个人肖像、身份信息等注册信息中不得含有违法和不良信息，包括但不限于下列情形：
（1）违反宪法或法律法规规定的；
（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
（3）损害国家荣誉和利益的，损害公共利益的；
（4）煽动民族仇恨、民族歧视，破坏民族团结的；
（5）破坏国家宗教政策，宣扬邪教和封建迷信的；
（6）散布谣言，扰乱社会秩序，破坏社会稳定的
（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
（8）侮辱或者诽谤他人，侵害他人合法权益的；
（9）含有法律、行政法规禁止的其他内容的。
如您存在上述行为，我方有权按照本服务协议第二条第5款规定进行处理。
2. 您在使用本服务时，必须遵守中华人民共和国相关法律法规的规定，您应同意将不会利用该服务进行任何违法或不正当的活动，包括但不限于下列行为: 
（1）反对宪法所确定的基本原则的；
（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
（3）损害国家荣誉和利益的，侵犯第三人合法权益；
（4）煽动民族仇恨、民族歧视、破坏民族团结的；
（5）破坏国家宗教政策，宣扬邪教和封建迷信的；
（6）散布谣言，扰乱社会秩序，破坏社会稳定的；
（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
（8）侮辱或者诽谤他人，侵害他人合法权利的；
（9）含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；
（10）含有中国法律、法规、规章、条例、地方性法规以及任何具有法律效力之规范所限制或禁止的其它内容的。
您应对自己在使用本服务过程中的行为承担法律责任，包括但不限于：对受到侵害者进行赔偿，以及因您的行为导致我方承担行政处罚或侵权损害赔偿责任后，您应给予我方等额的赔偿。
3.Ego服务禁止用户违反本服务使用规则私自赠与、借用、租用、转让或售卖任何区块链账户地址或相关私钥。您基于本服务账户所进行的所有登入、兑换、奖励或相关使用行为，均视为您本人操作，代表您的真实意思表示，我方不对其产生的后果承担任何责任，您应自行承担相应责任。
4.如本服务过程中存在服务项目或需要收取相应费用，具体以服务页面公示为准。对于上述收费服务，我方将在用户首次使用具体服务之前给予明确提示，只有您同意根据提示确认并支付相关费用，您才能使用相应收费服务。
5.在提供服务过程中，我方有权制定或调整使用、发放、获取、兑换、奖励等相关规则，具体以页面展示或服务公告为准。
6.您同意我方有权基于司法、监管部门、监督机构的要求或自身业务原因，暂停、中断或终止向您提供全部或者部分本服务。
<code><span>第五条  知识产权</span></code>
1.您明确知悉并同意，本服务涉及Ego服务的相关软件及所有相关信息内容的所有权、知识产权等一切权利均归我方所有，包括但不限于相关程序代码、界面设计、版权框架、数据资料、账户、文字、图片、图形、图表、音频、视频等，除按照相关法律法规规定或具体有效的协议约定应当由相关权利人享有或予以开源许可的权利内容外。您在享受本服务时，应当受本协议以及软件及服务相关的具体服务条款、操作规则的约束。
2.对于您注册或提交的受著作权保护的信息，您应对该等信息的真实性、合法性负责，保证对该等信息拥有完整的、无瑕疵的所有权和知识产权或拥有完整的授权，并不存在任何侵犯第三方合法权益的情形，包括但不限于著作权、肖像权、商标权、专利权、企业名称权、商号权、商业秘密、个人隐私、合同权利等权利。所有因您非法注册或提交的内容而给任何第三方或我方造成的损害均由您个人承担全部的责任，我方不承担任何责任，且我方有义务配合第三方、司法机关或行政机关完成相关的取证，并根据法律、主管部门或司法部门的要求将您的注册信息给予披露。
<code><span>第六条  法律责任与免责</span></code>
1.我方对其所有服务将尽力维护其安全性及方便性，但对服务中非因我方过错所产生的信息，包括但不限于用户发布、储存的信息、账户地址、数字资产数量、信息数据等删除或储存失败不承担任何责任。
2.使用本服务涉及互联网服务，可能会受到各个环节不稳定因素的影响，存在因不可抗力 ，包括但不限于战争、地震、雷击、水灾、火灾、政府行为、电信部门技术管制、计算机病毒、黑客攻击、系统不稳定、用户所在位置、用户关机以及其他任何网络、技术、通信线路等原因造成的服务中断或不能满足用户要求的风险，用户须明白并自行承担以上风险，我方不承担任何责任。
3.用户因第三方如电信运营商部门的通讯线路故障、技术问题、网络、电脑故障、系统不稳定性及其他各种不可抗力，包括但不限于战争、地震、雷击、水灾、火灾、政府行为、电信部门技术管制等原因而遭受的经济损失，我方不承担任何责任。
4.因用户违反本协议或相关的服务条款的规定，导致或产生我方或其合作公司、关联方遭受任何第三方主张的任何索赔、要求或损失的（包括合理的诉讼费用和律师费用），您应承担赔偿责任。
<code><span>第七条 其他</span></code>
1.您同意，我方有权随时对本协议内容进行调整和补充，调整和补充以网页公告等方式予以公布。变更后的条款自公布之日起生效。若您在本协议变更的条款生效后，仍继续使用本服务的，则视为接受该等变更。若您不同意的，您有权终止本协议并停止使用本服务。
2.本协议适用中华人民共和国法律并据其解释。因本协议引起的或与本协议有关的争议，我方可与您协商解决。协商不成的，任何一方有权向武汉极意网络科技有限公司住所地人民法院提起诉讼。
3.本协议中未明确授予您的权利将由我方保留。
4.若有任何疑问，请通过浏览 https://www.egoid.me/ 网站下方的联系方式与我方联系。


                                                                                                                                                                                                                                                                                                                                   武汉极意网络科技有限公司
    </pre>
    </div>
  </div>
</template>

<style lang="scss" scoped>
@import "../style/global.scss";

code {
    span {
        font-weight: 500;
        color: #fff;
    }
}

.service {
  background-color: #0d1424;
  display: flex;
  justify-content: center;
  align-items: center;
  flex-direction: column;
  .content {
    display: flex;
    justify-content: center;
    align-items: center;
    flex-direction: column;
    width: 90vw;
    padding: 20px 0;
    pre {
      @include p(14px, 26px);
      color: #b8c7e0 !important;
      white-space: pre-wrap;

      @media screen and (min-width: 1180px) {
        width: 1180px;
      }
    }

    p {
      width: 100%;
      text-align: right;
    }
  }
}
</style>
